In [1]:
%load_ext sql
%sql mysql+mysqldb://root:admin@localhost/

In [2]:
%%sql
DROP DATABASE IF EXISTS issl3;
CREATE DATABASE issl3;
USE issl3;

CREATE TABLE IF NOT EXISTS `accounts` (
	`id` int(11) NOT NULL AUTO_INCREMENT,
  	`username` varchar(50) NOT NULL,
  	`password` varchar(255) NOT NULL,
  	`email` varchar(100) NOT NULL,
    PRIMARY KEY (`id`)
);

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
(MySQLdb.OperationalError) (1065, 'Query was empty')
(Background on this error at: http://sqlalche.me/e/e3q8)

In [3]:
%%sql
select * from accounts

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [4]:
%%sql
DROP DATABASE IF EXISTS `issl3` ;
CREATE DATABASE `issl3`;
USE `issl3`;

CREATE TABLE IF NOT EXISTS `accounts` (
	`id` int(11) NOT NULL AUTO_INCREMENT,
  	`username` varchar(50) NOT NULL,
  	`password` varchar(255) NOT NULL,
  	`email` varchar(100) NOT NULL,
    PRIMARY KEY (`id`)
);

CREATE TABLE IF NOT EXISTS `books` (
	`id` int(11) NOT NULL AUTO_INCREMENT,
  	`title` varchar(50) NOT NULL,
  	`author` varchar(255) NOT NULL,
  	`year` int NOT NULL,
  	`genre` varchar(255)  NOT NULL,
  	`rating` int  NOT NULL,
    PRIMARY KEY (`id`)
);


INSERT INTO `accounts` (`id`, `username`, `password`, `email`) VALUES (1, 'test', 'test', 'test@test.com');

INSERT INTO `books`  (`title`, `author`, `year`, `genre`, `rating`) VALUES ('The Hobbit','J.R.R. Tolkien',1937,'Fantasy', 5);	    
INSERT INTO `books`  (`title`, `author`, `year`, `genre`, `rating`) VALUES ('Harry Potter and the Philosophers Stone','J.K. Rowling',1997,'Fantasy', 5);	  
INSERT INTO `books`  (`title`, `author`, `year`, `genre`, `rating`) VALUES ('And Then There Were None','Agatha Christie',1939,'Mystery', 4 );	 
INSERT INTO `books`  (`title`, `author`, `year`, `genre`, `rating`) VALUES ('Charlotte\'s Web','E.B. White',1952,'Children\'s fiction', 4 ); 
INSERT INTO `books`  (`title`, `author`, `year`, `genre`, `rating`) VALUES ('The Da Vinci Code','Dan Brown',2003,'Thriller', 3 ); 
INSERT INTO `books`  (`title`, `author`, `year`, `genre`, `rating`) VALUES ('Nineteen Eighty-Four','George Orwell',1949,'Science Fiction	', 3 );

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
(MySQLdb.OperationalError) (1065, 'Query was empty')
(Background on this error at: http://sqlalche.me/e/e3q8)

In [5]:
%%sql
select * from books

 * mysql+mysqldb://root:***@localhost/
6 rows affected.

[(1, 'The Hobbit', 'J.R.R. Tolkien', 1937, 'Fantasy', 5),
 (2, 'Harry Potter and the Philosophers Stone', 'J.K. Rowling', 1997, 'Fantasy', 5),
 (3, 'And Then There Were None', 'Agatha Christie', 1939, 'Mystery', 4),
 (4, "Charlotte's Web", 'E.B. White', 1952, "Children's fiction", 4),
 (5, 'The Da Vinci Code', 'Dan Brown', 2003, 'Thriller', 3),
 (6, 'Nineteen Eighty-Four', 'George Orwell', 1949, 'Science Fiction\t', 3)]